In [1]:
import pandas as pd
import numpy as np

In [2]:
students_performance = \
    pd.read_csv('https://stepik.org/media/attachments/course/4852/StudentsPerformance.csv')

In [11]:
students_performance

,gender,race/ethnicity,parental_level_of_education,lunch,test_preparation_course,math_score,reading_score,writing_score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75
...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95
996,male,group C,high school,free/reduced,none,62,55,55
997,female,group C,high school,free/reduced,completed,59,71,65
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86

In [5]:
students_performance.columns = \
    students_performance.columns.str.replace(' ','_')

In [6]:
students_performance.groupby('gender', as_index=False).mean()

   gender  math_score  reading_score  writing_score
0  female   63.633205      72.608108      72.467181
1    male   68.728216      65.473029      63.311203

In [9]:
students_performance.groupby('gender', as_index=False)\
    .agg({'math_score':'mean','reading_score':'mean'})\
    .rename(columns={'math_score':'mean_math_score','reading_score':'mean_reading_score'})

   gender  mean_math_score  mean_reading_score
0  female        63.633205           72.608108
1    male        68.728216           65.473029

In [10]:
students_performance.groupby('gender', as_index=False)\
    .aggregate({'math_score': ['mean', 'count', 'std'],'reading_score': ['std', 'min', 'max']})

   gender math_score                  reading_score
                mean count        std           std min  max
0  female  63.633205   518  15.491453     14.378245  17  100
1    male  68.728216   482  14.356277     13.931832  23  100

In [12]:
students_performance.groupby(['gender','race/ethnicity'], as_index=False)\
    .agg({'math_score':'mean','reading_score':'mean'})\
    .rename(columns={'math_score':'mean_math_score','reading_score':'mean_reading_score'})

   gender race/ethnicity  mean_math_score  mean_reading_score
0  female        group A        58.527778           69.000000
1  female        group B        61.403846           71.076923
2  female        group C        62.033333           71.944444
3  female        group D        65.248062           74.046512
4  female        group E        70.811594           75.840580
5    male        group A        63.735849           61.735849
6    male        group B        65.930233           62.848837
7    male        group C        67.611511           65.424460
8    male        group D        69.413534           66.135338
9    male        group E        76.746479           70.295775

In [13]:
students_performance.groupby(['gender','race/ethnicity'])\
    .agg({'math_score':'mean','reading_score':'mean'})\
    .rename(columns={'math_score':'mean_math_score','reading_score':'mean_reading_score'})

                       mean_math_score  mean_reading_score
gender race/ethnicity
female group A               58.527778           69.000000
       group B               61.403846           71.076923
       group C               62.033333           71.944444
       group D               65.248062           74.046512
       group E               70.811594           75.840580
male   group A               63.735849           61.735849
       group B               65.930233           62.848837
       group C               67.611511           65.424460
       group D               69.413534           66.135338
       group E               76.746479           70.295775

In [18]:
# Топ5 математиков юношей и девушек

students_performance\
    .sort_values(['gender','math_score'], ascending=False)\
    .groupby('gender').head()

,gender,race/ethnicity,parental_level_of_education,lunch,test_preparation_course,math_score,reading_score,writing_score
149,male,group E,associate's degree,free/reduced,completed,100,100,93
623,male,group A,some college,standard,completed,100,96,86
625,male,group D,some college,standard,completed,100,97,99
916,male,group E,bachelor's degree,standard,completed,100,100,100
306,male,group E,some college,standard,completed,99,87,81
451,female,group E,some college,standard,none,100,92,97
458,female,group E,bachelor's degree,standard,none,100,100,100
962,female,group E,associate's degree,standard,none,100,100,100
114,female,group E,bachelor's degree,standard,completed,99,100,100
263,female,group E,high school,standard,none,99,93,90

In [19]:
students_performance\
    .sort_values(['gender', 'math_score'], ascending=[True, False])

,gender,race/ethnicity,parental_level_of_education,lunch,test_preparation_course,math_score,reading_score,writing_score
451,female,group E,some college,standard,none,100,92,97
458,female,group E,bachelor's degree,standard,none,100,100,100
962,female,group E,associate's degree,standard,none,100,100,100
114,female,group E,bachelor's degree,standard,completed,99,100,100
263,female,group E,high school,standard,none,99,93,90
...,...,...,...,...,...,...,...,...
211,male,group C,some college,free/reduced,none,35,28,27
76,male,group E,some high school,standard,none,30,26,22
596,male,group B,high school,free/reduced,none,30,24,15
327,male,group A,some college,free/reduced,none,28,23,19
91,male,group C,high school,free/reduced,none,27,34,36

In [20]:
students_performance['total_score'] = (students_performance.math_score
    + students_performance.reading_score + students_performance.writing_score)

In [21]:
students_performance.head()

,gender,race/ethnicity,parental_level_of_education,lunch,test_preparation_course,math_score,reading_score,writing_score,total_score
0,female,group B,bachelor's degree,standard,none,72,72,74,218
1,female,group C,some college,standard,completed,69,90,88,247
2,female,group B,master's degree,standard,none,90,95,93,278
3,male,group A,associate's degree,free/reduced,none,47,57,44,148
4,male,group C,some college,standard,none,76,78,75,229

In [22]:
students_performance = students_performance\
    .assign(total_score_log = np.log(students_performance.total_score))

In [24]:
students_performance.head()

,gender,race/ethnicity,parental_level_of_education,lunch,test_preparation_course,math_score,reading_score,writing_score,total_score,total_score_log
0,female,group B,bachelor's degree,standard,none,72,72,74,218,5.384495
1,female,group C,some college,standard,completed,69,90,88,247,5.509388
2,female,group B,master's degree,standard,none,90,95,93,278,5.627621
3,male,group A,associate's degree,free/reduced,none,47,57,44,148,4.997212
4,male,group C,some college,standard,none,76,78,75,229,5.433722

In [25]:
students_performance.drop(['total_score'], axis=1)

,gender,race/ethnicity,parental_level_of_education,lunch,test_preparation_course,math_score,reading_score,writing_score,total_score_log
0,female,group B,bachelor's degree,standard,none,72,72,74,5.384495
1,female,group C,some college,standard,completed,69,90,88,5.509388
2,female,group B,master's degree,standard,none,90,95,93,5.627621
3,male,group A,associate's degree,free/reduced,none,47,57,44,4.997212
4,male,group C,some college,standard,none,76,78,75,5.433722
...,...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95,5.641907
996,male,group C,high school,free/reduced,none,62,55,55,5.147494
997,female,group C,high school,free/reduced,completed,59,71,65,5.273000
998,female,group D,some college,standard,completed,68,78,77,5.407172
999,female,group D,some college,free/reduced,none,77,86,86,5.517453

In [27]:
# Сумма всех score построчно

students_performance.filter(like = 'score').sum(axis=1)

0      441.384495
1      499.509388
2      561.627621
3      300.997212
4      463.433722
          ...
995    569.641907
996    349.147494
997    395.273000
998    451.407172
999    503.517453
Length: 1000, dtype: float64

In [ ]:
# ДЗ

In [28]:
# Пересчитаем число ног у героев игры Dota2
dh = pd.read_csv('https://stepik.org/media/attachments/course/4852/dota_hero_stats.csv')
dh.aggregate({'legs': 'value_counts'}).sort_index()

   legs
0    11
2    95
4     7
6     3
8     1

In [29]:
dh['legs'].value_counts()

2    95
0    11
4     7
6     3
8     1
Name: legs, dtype: int64

In [ ]:
# У кого из больше средний заработок в различных категориях

In [30]:
accountancy = pd.read_csv('https://stepik.org/media/attachments/course/4852/accountancy.csv')

In [31]:
accountancy.drop('Unnamed: 0', axis=1) \
        .groupby(['Type', 'Executor'], as_index=False) \
        .mean() \
        .sort_values(['Type', 'Salary'], ascending=[True, False]) \
        .groupby('Type') \
        .head(1)

   Type Executor      Salary
1     A     Pupa  160.833333
2     B    Loopa  145.166667
4     C    Loopa  154.333333
7     D     Pupa  146.500000
8     E    Loopa  164.000000
10    F    Loopa  238.000000

In [ ]:
# Сгруппируем по колонкам attack_type и primary_attr
# и выберем самый распространённый набор характеристик.

In [32]:
dh.filter(items=['attack_type','primary_attr']).mode()

  attack_type primary_attr
0      Ranged          int

In [ ]:
# Средняя концентрация каждого из веществ в каждом из родов

In [38]:
algae = pd.read_csv('http://stepik.org/media/attachments/course/4852/algae.csv')

In [39]:
mean_concentrations = algae.groupby('genus').mean()

In [40]:
mean_concentrations

              sucrose    alanin   citrate   glucose  oleic_acid
genus
Ascophyllum  6.825467  0.875429  5.253527  3.414961    2.432526
Cladophora   4.008792  3.997055  5.288311  2.800276    2.263472
Fucus        4.355112  3.566411  4.214878  2.814803    3.367647
Palmaria     0.704580  3.176440  5.573905  3.242090    2.245538
Saccharina   4.183596  3.524207  3.346710  4.980594    4.487252

In [ ]:
# минимальная, средняя и максимальная концентрации аланина (alanin)
# среди видов рода Fucus

In [43]:
algae.groupby('genus').agg(['min', 'mean', 'max']) \
.loc['Fucus', 'alanin'].round(2)

min     0.35
mean    3.57
max     6.64
Name: Fucus, dtype: float64

In [45]:
# или
'{min} {mean} {max}'.format(
    **algae.loc[algae.genus == 'Fucus', 'alanin'] \
        .agg(['min', 'mean', 'max']) \
        .round(2)
)

'0.35 3.57 6.64'

In [48]:
algae.groupby('group', as_index=False) \
    .agg({'citrate': 'var', 'sucrose': lambda x: x.max() - x.min(), 'glucose': 'count'}) \
    .round(2)\
    .rename(columns={'citrate':'citrate_variance', 'sucrose':'sucrose_range','glucose': 'count_of_types'})

   group  citrate_variance  sucrose_range  count_of_types
0  brown              5.47           5.19               6
1  green              3.95           3.26               3
2    red               NaN           0.00               1